#利他賭けの方向
import matplotlib.pyplot as plt
import networkx as nx

G = nx.DiGraph()
# 頂点の追加
G.add_nodes_from(['A','B','C','D','E','F','G','H','I','J'])                

# 辺の追加 (頂点も必要に応じて追加さ0れます)

G.add_edges_from([
('A', 'C'),('A', 'D'),('A', 'E'),('A', 'G'),('A', 'J'),
('B', 'C'),('B', 'F'),('B', 'H'),
('C', 'A'),('C', 'B'),('C', 'D'),('C', 'E'),('C', 'F'),('C', 'G'),
('D', 'C'),('D', 'E'),('D', 'F'),('D', 'G'),('D', 'H'),('D', 'I'),
('E', 'D'),('E', 'F'),('E', 'H'),('E', 'I'),
('F', 'B'),('F', 'D'),('F', 'E'),('F', 'F'),('F', 'H'),('F', 'I'),
('G', 'D'),('G', 'F'),('G', 'H'),
('H', 'A'),('H', 'C'),('H', 'D'),('H', 'E'),('H', 'F'),('H', 'I'),
('I', 'D'),('I', 'E'),('I', 'F'),('I', 'H'),('I', 'J'),
('J', 'B'),('J', 'C'),('J', 'D'),('J', 'F'),('J', 'G'),('J', 'H'),
                 ])

pos = {
    'A': (40, 90),
    'B': (60, 90),
    'C': (10, 70),
    'D': (25, 50),
    'E': (10, 30),
    'F': (80, 65),
    'G': (95, 55),
    'H': (85, 40),
    'I': (50, 10),
    'J': (70, 10)
}

#ノードの大きさは利他行為された回数(y=200x)
node_size=[393,787,2362,6496,1574,6889,787,3346,1574,787]
width = [5,3,2,1,2,1,6,5,1,2,5,1,3,1,1,2,5,1,1,3,3,6,2,2,1,6,1,1,3,1,4,5,3,1,2,3,1,4,2,8,1,1,1,1,1,3,1,4,1,2,1]
width2 = []
for i in width:
    width2.append(i / 2)

nx.draw(G, pos=pos  , node_size= node_size , width = width2, with_labels=True)
plt.show()